; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v2 ?v3)
             (pred_9 ?v10 ?v6)
             (pred_7 ?v2 ?v6)
             (pred_3 ?v13 ?v2 )
	     (pred_1 ?v2)
             (pred_11 ?v5)
             (pred_6 ?v10)
             (pred_8 ?v6)
             (pred_2 ?v2)
             (pred_4 ?v10)
             (pred_10 ?v2)
             (pred_5 ))



(:action op_1
:parameters (?v1 ?v9 ?v7 ?v12)
:precondition (and (pred_11 ?v1) (pred_11 ?v9) (pred_6 ?v7) (pred_8 ?v12)
          (pred_12 ?v1 ?v9) (pred_9 ?v7 ?v12)
                   (pred_7 ?v9 ?v12) (pred_1 ?v1) 
                   (pred_2 ?v9) (pred_4 ?v7))
:effect (and  (pred_10 ?v9) (not (pred_2 ?v9))))


(:action op_4
:parameters (?v1 ?v11)
:precondition (and (pred_11 ?v1) (pred_11 ?v11)
               (pred_1 ?v1) (pred_12 ?v1 ?v11) (pred_10 ?v11))
:effect (and (pred_1 ?v11) (not (pred_1 ?v1))))

(:action op_3
:parameters (?v1 ?v7)
:precondition (and (pred_11 ?v1) (pred_6 ?v7) 
                  (pred_1 ?v1) (pred_3 ?v7 ?v1) (pred_5 ))
:effect (and (pred_4 ?v7)
   (not (pred_3 ?v7 ?v1)) (not (pred_5 ))))


(:action op_2
:parameters (?v1 ?v8 ?v4)
:precondition (and (pred_11 ?v1) (pred_6 ?v8) (pred_6 ?v4)
                  (pred_1 ?v1) (pred_4 ?v4) (pred_3 ?v8 ?v1))
:effect (and (pred_4 ?v8) (pred_3 ?v4 ?v1)
        (not (pred_4 ?v4)) (not (pred_3 ?v8 ?v1))))

(:action op_5
:parameters (?v1 ?v7)
:precondition (and (pred_11 ?v1) (pred_6 ?v7) 
                  (pred_1 ?v1) (pred_4 ?v7))
:effect (and (pred_5 ) (pred_3 ?v7 ?v1) (not (pred_4 ?v7)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_16 obj_08 obj_15 obj_01 obj_12 obj_13 obj_05 obj_22 obj_11 obj_20 obj_14 obj_21 obj_02 obj_06 obj_18
    obj_09 obj_03 obj_17
    obj_07 obj_19 obj_10
    )

    (:init
       (pred_5)

       (pred_11 obj_04)
       (pred_11 obj_16)
       (pred_11 obj_08)
       (pred_11 obj_15)
       (pred_11 obj_01)
       (pred_11 obj_12)
       (pred_11 obj_13)
       (pred_11 obj_05)
       (pred_11 obj_22)
       (pred_11 obj_11)
       (pred_11 obj_20)
       (pred_11 obj_14)
       (pred_11 obj_21)
       (pred_11 obj_02)
       (pred_11 obj_06)
       (pred_11 obj_18)
       (pred_8 obj_09)
       (pred_8 obj_03)
       (pred_8 obj_17)
       (pred_6 obj_07)
       (pred_6 obj_19)
       (pred_6 obj_10)

       (pred_12 obj_04 obj_01)
       (pred_12 obj_04 obj_16)
       (pred_12 obj_16 obj_12)
       (pred_12 obj_16 obj_08)
       (pred_12 obj_16 obj_04)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_08 obj_15)
       (pred_12 obj_08 obj_16)
       (pred_12 obj_15 obj_05)
       (pred_12 obj_15 obj_08)
       (pred_12 obj_01 obj_22)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_04)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_12 obj_13)
       (pred_12 obj_12 obj_16)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_13 obj_20)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_13 obj_12)
       (pred_12 obj_05 obj_14)
       (pred_12 obj_05 obj_15)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_22 obj_21)
       (pred_12 obj_22 obj_11)
       (pred_12 obj_22 obj_01)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_11 obj_20)
       (pred_12 obj_11 obj_12)
       (pred_12 obj_11 obj_22)
       (pred_12 obj_20 obj_06)
       (pred_12 obj_20 obj_14)
       (pred_12 obj_20 obj_13)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_14 obj_05)
       (pred_12 obj_14 obj_20)
       (pred_12 obj_21 obj_02)
       (pred_12 obj_21 obj_22)
       (pred_12 obj_02 obj_06)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_02 obj_21)
       (pred_12 obj_06 obj_18)
       (pred_12 obj_06 obj_20)
       (pred_12 obj_06 obj_02)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_06)
       (pred_2 obj_15)
       (pred_2 obj_18)
       (pred_2 obj_13)
       (pred_7  obj_15 obj_09)
       (pred_7  obj_18 obj_03)
       (pred_7  obj_13 obj_17)
       (pred_10 obj_04)
       (pred_10 obj_16)
       (pred_10 obj_08)
       (pred_10 obj_01)
       (pred_10 obj_12)
       (pred_10 obj_05)
       (pred_10 obj_22)
       (pred_10 obj_11)
       (pred_10 obj_20)
       (pred_10 obj_14)
       (pred_10 obj_21)
       (pred_10 obj_02)
       (pred_10 obj_06)

       (pred_9  obj_07 obj_09)
       (pred_9  obj_19 obj_03)
       (pred_9  obj_10 obj_17)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_19 obj_20)
       (pred_3 obj_10 obj_01)
       (pred_1 obj_11)
    )

    (:goal (and
       (pred_3 obj_10 obj_16)
    ))
(:constraints
  (always (not (pred_1 obj_12)))
)
)

; plan
1. (op_4 obj_11 obj_22)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_22)
   goals met: 0 of 1
2. (op_4 obj_22 obj_01)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_01)
   goals met: 0 of 1
3. (op_3 obj_01 obj_10)
   deleted: (pred_3 obj_10 obj_01) (pred_5)
   added: (pred_4 obj_10)
   goals met: 0 of 1
4. (op_4 obj_01 obj_04)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_04)
   goals met: 0 of 1
5. (op_4 obj_04 obj_16)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_16)
   goals met: 0 of 1
6. (op_5 obj_16 obj_10)
   deleted: (pred_4 obj_10)
   added: (pred_5) (pred_3 obj_10 obj_16)
   goals met: 1 of 1
